# tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
# tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# tap "jesseduffield/lazygit"
# Clone of cat(1) with syntax highlighting and Git integration
# brew "bat"

# Command-line fuzzy finder written in Go
# brew "fzf"
# Distributed revision control system
brew "git"

# Interpreted, interactive, object-oriented programming language
# brew "python@3.8"
# Asynchronous event library
# brew "libevent"

# Add GitHub support to git on the command-line
# brew "hub"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Fast, highly customisable system info script
# brew "neofetch"

# Ambitious Vim-fork focused on extensibility and agility
# brew "neovim"

# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"

# Search tool like grep and The Silver Searcher
# brew "ripgrep"

# Command-line interface for https://speedtest.net bandwidth tests
# brew "speedtest-cli"

# Cross-shell prompt for astronauts
brew "starship"

# Programatically correct mistyped console commands
# brew "thefuck"

# Terminal multiplexer
brew "tmux"

# Display directories as trees (with optional color/HTML output)
# brew "tree"

# Watch files and take action when they change
brew "watchman"

# JavaScript package manager
brew "yarn"

# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"

# Kubernetes CLI To Manage Your Clusters In Style!
# brew "derailed/k9s/k9s"

# A simple terminal UI for git commands, written in Go
# brew "jesseduffield/lazygit/lazygit"
# cask "alacritty"
cask "discord"
cask "font-hack-nerd-font"
cask "fork"
cask "iterm2"
cask "java"
cask "notion"
cask "qmk-toolbox"
# cask "react-native-debugger"
cask "slack"
cask "soundsource"
cask "spotify"
cask "visual-studio-code"
